In [1]:
import numpy as np
import pandas as pd

In [2]:
goals_df = pd.DataFrame({'Player':['Aneesh', 'Kalvin','Patrick', 'Stuart'], 'Goals':[1,4,6,2]})

In [3]:
goals_df

    Player  Goals
0   Aneesh      1
1   Kalvin      4
2  Patrick      6
3   Stuart      2

In [4]:
caps_df = pd.DataFrame({'Player':['Brendan', 'Kalvin', 'Archie', 'Stuart'], 'Caps':[5,5,6,3]})

In [5]:
caps_df

    Player  Caps
0  Brendan     5
1   Kalvin     5
2   Archie     6
3   Stuart     3

In [6]:
pd.merge(goals_df, caps_df, on='Player', how='inner')

   Player  Goals  Caps
0  Kalvin      4     5
1  Stuart      2     3

In [7]:
pd.merge(goals_df, caps_df, on='Player', how='left')

    Player  Goals  Caps
0   Aneesh      1   NaN
1   Kalvin      4   5.0
2  Patrick      6   NaN
3   Stuart      2   3.0

In [8]:
pd.merge(caps_df, goals_df, on='Player', how='left')

    Player  Caps  Goals
0  Brendan     5    NaN
1   Kalvin     5    4.0
2   Archie     6    NaN
3   Stuart     3    2.0

In [9]:
pd.merge(goals_df, caps_df, on='Player', how='right')

    Player  Goals  Caps
0  Brendan    NaN     5
1   Kalvin    4.0     5
2   Archie    NaN     6
3   Stuart    2.0     3

In [10]:
pd.merge(goals_df, caps_df, on='Player', how='outer')

    Player  Goals  Caps
0   Aneesh    1.0   NaN
1   Kalvin    4.0   5.0
2  Patrick    6.0   NaN
3   Stuart    2.0   3.0
4  Brendan    NaN   5.0
5   Archie    NaN   6.0

In [11]:
goals_df = goals_df.set_index('Player')

In [12]:
goals_df

         Goals
Player
Aneesh       1
Kalvin       4
Patrick      6
Stuart       2

In [13]:
pd.merge(goals_df, caps_df, left_index=True, right_on='Player', how='inner')

   Goals  Player  Caps
1      4  Kalvin     5
3      2  Stuart     3

In [15]:
goals_df = pd.DataFrame({'name':['Aneesh', 'Kalvin','Patrick', 'Stuart'], 'Goals':[1,4,6,2]})

In [16]:
goals_df

      name  Goals
0   Aneesh      1
1   Kalvin      4
2  Patrick      6
3   Stuart      2